In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    'Age': [46,37,44,42,42],
    'Country': ['Spain','Spain','Germany','Germany','France'],
    'Gender': ['Female','Female','Male','Male','Male']
})
df

   Age  Country  Gender
0   46    Spain  Female
1   37    Spain  Female
2   44  Germany    Male
3   42  Germany    Male
4   42   France    Male

In [3]:
df['Age']

0    46
1    37
2    44
3    42
4    42
Name: Age, dtype: int64

In [4]:
df.Country

0      Spain
1      Spain
2    Germany
3    Germany
4     France
Name: Country, dtype: object

In [5]:
df[['Country','Age']]

   Country  Age
0    Spain   46
1    Spain   37
2  Germany   44
3  Germany   42
4   France   42